CSI API ETABS v1
cLoadCases.SetDesignType Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDesignType(
	string Name,
	int DesignTypeOption,
	eLoadPatternType DesignType = eLoadPatternType.Dead
)
Function SetDesignType (
	Name As String,
	DesignTypeOption As Integer,
	Optional DesignType As eLoadPatternType = eLoadPatternType.Dead
) As Integer
Dim instance As cLoadCases
Dim Name As String
Dim DesignTypeOption As Integer
Dim DesignType As eLoadPatternType
Dim returnValue As Integer
returnValue = instance.SetDesignType(Name,
	DesignTypeOption, DesignType)
int SetDesignType(
	String^ Name,
	int DesignTypeOption,
	eLoadPatternType DesignType = eLoadPatternType::Dead
)
abstract SetDesignType :
        Name : string *
        DesignTypeOption : int *
        ?DesignType : eLoadPatternType
(* Defaults:
        let _DesignType = defaultArg DesignType eLoadPatternType.Dead
*)
-> int
Parameters
Name
Type: System.String
DesignTypeOption
Type: System.Int32
DesignType (Optional)
Type: ETABSv1.eLoadPatternType
Return Value
Type: Int32
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace